#### ExternalResourceLoadContent Members

---

|  |
| --- |
| ExternalResourceLoadContent Class   Methods   Properties   See Also |

The  ExternalResourceLoadContent  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ExternalResourceLoadContent |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | LoadStatus | A value to indicate the status of an external resource load operation. IExternalResourceServers should set this in the LoadResource() method. |
| Public property | Version | The version of the external data that the server is providing in this object. |

# See Also

ExternalResourceLoadContent Class

Autodesk.Revit.DB Namespace